In [1]:
# operations

In [3]:
import numpy as np
import pandas as pd

In [7]:
df = pd.DataFrame({"Col1":[1,2,3,4],
                    "Col2":[444,555,666,444],
                     "Col3" :["abc", "def", "ghi", "xyz"]})
df.head()

   Col1  Col2 Col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [12]:
df["Col2"].unique()

array([444, 555, 666], dtype=int64)

In [13]:
df["Col2"].nunique()

3

In [15]:
df["Col2"].value_counts()

Col2
444    2
555    1
666    1
Name: count, dtype: int64

In [17]:
df["Col1"]>2

0    False
1    False
2     True
3     True
Name: Col1, dtype: bool

In [18]:
def times2(x):
    return x*2

In [20]:
df["Col1"].apply(times2)

0    2
1    4
2    6
3    8
Name: Col1, dtype: int64

In [23]:
df["Col2"].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: Col2, dtype: int64

In [24]:
df

   Col1  Col2 Col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [29]:
df.drop("Col1", axis=1, inplace=True)

In [30]:
df

   Col2 Col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [31]:
df.columns

Index(['Col2', 'Col3'], dtype='object')

In [32]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [35]:
df.sort_values("Col2")

   Col2 Col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [37]:
# about no value in data frame

In [38]:
df.isnull()

    Col2   Col3
0  False  False
1  False  False
2  False  False
3  False  False

In [39]:
df

   Col2 Col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz